// CONFIGURATION
const SCRIPT_URL = 'https://script.google.com/macros/s/AKfycbytVBFkT6gkKLMAkyA6NNxCOs641gRV9vQjbEoaccn9Ipn-SNYkqbDRuR_UDmB1UXEgzg/exec';

// Dynamic Floor Configuration
const buildingFloors = {
    '親民樓': ['1F', '2F', '3F', '4F', '5F'],
    '梅苑': ['1F', '2F', '3F', '4F', '5F'],
    '格物樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '致知樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '聚賢樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '明德樓': ['1F', '2F', '3F', '4F'],
    '至善樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '蘭苑': ['1F', '2F', '3F', '4F', '5F'],
    '誠意樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '日新樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '莊敬樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '自強樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '正心樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '學誠樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '學樸樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '篤行樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '華夏樓': ['1F', '2F', '3F', '4F'],
    '漢光樓': ['1F', '2F', '3F', '4F'],
    '竹水樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '華光樓': ['1F', '2F', '3F', '4F'],
    '弘道樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F', '8F'],
    '弘毅樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F', '8F'],
    '弘遠樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F', '8F'],
    '弘學樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F', '8F'],
    '學禮樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F', '8F', '9F', '10F', '11F', '12F'],
    '弘德樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F', '8F'],
    '中興樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '竹山樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F'],
    '弘仁樓': ['1F', '2F', '3F', '4F', '5F', '6F', '7F', '8F']
};
